init:
    $ mods["iailil"]=u"Everlasting Gay Porn"
    $ dnl= Character(u'Даня', color="66FF33", what_color="E2C778",)
    image bg MeAndYou = "mods/ES-TopSecretOfCyberneticks/Content/Sy_hxds_kVk.jpg"
   
label iailil:
    scene anim prolog_1 
    with dissolve2
    $ set_mode_adv()
    play music music_list["a_promise_from_distant_days"] fadein 5
    th "Мне снова снился странный сон."
    th "Вокруг какие-то девушки, но мне нет до них дела.{w} Почему они являются мне?"
    th "Лишь иногда в этих снах я могу уловить силуэты нормальных пацанов, с которыми можно побазарить по душам бля буду."
    th "Что-то случилось, и я заснул короче" 
    scene bg semen_room
    with dissolve2
    th "Моя квартира - это только моя квартира.{w} Моё личное пространство."
    th "Только здесь я себя чувствую себя спокойно. {w}Только тут живы мое сознание,воображение и чувства."
    th "Трудно найти более защищенное для меня и моих мыслей место, чем эта маленькая квартирка в спальном районе города."
    th "Здесь я защищен от всех внешних факторов большого города: суета, плохая погода, а самое важное - социум. "
    stop music fadeout 2
    with dissolve2
    $ set_mode_nvl() 
    play music music_list["farewell_to_the_past_full"] fadein 1
    "Когда-то это место было не только для меня, но эти времена давно в прошлом."
    "Да что уж там, раньше я даже мог проводить свой досуг вне дома больше, чем пару часов в неделю."
    "Общение с людьми, долгие прогулки по паркам, бесчисленное количество вечеринок и праздников. Все это было, сейчас - нет."
    "Теперь я твёрдо уверен, что всё, что мне нужно - это лишь я сам.{w} Ещё системный блок с монитором."
    "Всё из-за цепочки событий, в ходе которой я убедился, что крепко связывать себя с кем-либо чревато последующими болью и страданием."
    "Это неизбежно.{w} Никто не сможет понять тебя, как ты сам.{w} А те, кто считают иначе - тешатся одной лишь мыслью об этом." 
    $ set_mode_nvl()
    "Так, понемногу, я начал отдаляться от остального мира."
    "И совсем не важно, по какой причине это произошло. {w}Рано или поздно осознание должно было прийти, сейчас я это прекрасно понимаю."
    "Я бы не сказал, что мой метод познания истины был действительно мучительным."
    "Через это прошли множество таких же парней, как и я.{w} Разочарование в верности, в любви, в ...{w} Затем суды, выяснение правоты и просто желание отомстить."
    $ set_mode_nvl() 
    "Чем же я занимаюсь у себя дома?{w} Можно сказать ничем. {w} Унылая и однообразная работа в офисе плавно сменилась фрилансом, на это занятие у меня уходит только пару часов в день."
    "Но зато теперь мне не приходится подрываться в 6 утра, чтобы вовремя оказаться на работе в кругу таких же офисных планктонов. "
    "Так что остальное время я полностью предаюсь гедонизму. {w}Сериалы, игры, аниме."
    "Когда особенно скучно, вступаю в дискуссии с такими же отшельниками, как и я, на различные темы."
    "С некоторыми из них даже получается поддерживать общение весьма долгое время, но никаких попыток встретиться в ИРЛ я не принимаю."
    "Ну вот мы сядем в кафе, и  будем молчать. {w}Зачем?"
    "Гораздо легче иметь дело с людьми в интернете,{w} Легче скрывать то, что не хотел бы показывать."
    $ set_mode_adv()
    "Наверняка многие не поймут меня. {w}С их точки зрения в жизни нужно чего-то добиться."
    "Оставить после себя след, записать своё имя в учебник истории, засесть в памяти людей. {w}Или хотя бы построить дом, посадить дерево, вырастить сына."
    "Но какой в этом всём смысл?"
    "Во-первых, когда я умру, мне будет абсолютно наплевать на то, что произойдёт после моей смерти."
    "А во-вторых, тенденция во вселенной такова, что всё когда-либо разрушается.{w} Все отлично знают, что вселенная возникла в результате Большого Взрыва, при котором было высвобождено огромное количество энергии."
    "Которая с каждой секундой рассеивается всё больше. {w}Звёзды погибают, планеты просто превращаются в огромные глыбы, распадающиеся с течением времени."
    "Нет ничего вечного. {w}Так зачем же лезть из кожи вон ради сомнительных достижений? {w}Я предпочитаю жить просто, в удовольствие." 
    hide bg semen_room
    with dissolve2
    scene bg semen_room_window
    with dissolve2
    "Я стою, курю в окно и наблюдаю за человечками-муравьями, бродившими по белому полотну на несколько этажей ниже меня."
    th "Интересно, как они размышляют? {w}Приходят ли им в голову те же мысли, что и мне?"
    th "Вряд ли.{w} Если бы так и было, я не наблюдал бы сейчас за ними."
    "Впрочем, мне и самому через несколько часов нужно оказаться на улице.{w} Каждый год, утром первого января я имею обычай гулять по пустынному городу."
    "Земля совершила ещё один оборот вокруг Солнца. {w}Казалось бы, чего тут праздновать?"
    "Но людям только дай повод поразвлекаться и отдохнуть."
    "Нет, я не вижу в этом ничего плохого, но почему обязательно нужно оправдывать своё желание провести время в удовольствие?"
    "Выделили бы любой другой день и назвали бы его *День Праздника*.{w} Но нет, все стыдятся своей тяги к веселью."
    "Для меня же это возможность запечатлеть как будто вымершие улицы города. {w}Насладиться холодным зимним утром в одиночестве."
    "Гулять в другие дни ночью я не люблю, да и всё равно кого-нибудь встретишь на своём пути."
    "А во время новогоднего рассвета в городе абсолютно пусто."
    scene bg semen_room
    with dissolve2
    "Праздничную ночь я провёл за просмотром аниме."
    "Дождался семи утра и вышел на улицу."
    hide bg semen_room
    with dissolve2
    stop music fadeout 2
    "..."   
    scene bg bus_stop
    with dissolve2
    play ambience ambience_cold_wind_loop
    show snow
    "Воздух стоял очень морозный, дыхание моментально схватило. {w}Зря, конечно, не посмотрел погоду перед выходом, по ощущениям было градусов -25, если не ниже."
    "Я зажёг сигарету и двинулся по излюбленному маршруту."
    "А он лежал через места,значившие многое для меня раньше."
    "Вот лавка, на которой произошёл наш первый поцелуй. {w}А в этом месте мы любили осанавливаться на перекур."
    "Только раз в год позволяю себе не отгонять эти мысли. {w}Всё-таки я человек."
    hide bg bus_stop
    with dissolve
    scene bg bus_stop
    with dissolve
    "Всё дальше и дальше отправляла меня цепочка туманных, казалось бы уже почти чужих воспоминаний"
    "Мимо мрачных хрущевок, на некоторых из которых иронично выложены мозаикой призывы к светлому советскому будущему.{w} Мимо деревянных бараков, от которых веяло бедностью.{w} Мимо неработающего фонтана, в зимнее время выглядевшего особенно уныло и серо."
    "Впереди забрезжило что-то наподобие начинающегося рассвета."
    "Вся обстановка поспособствовала тому, что я невольно задумался о том, что же я делаю со своей жизнью."
    "А кто-нибудь знает, как нужно правильно жить? {w}У каждого своя правда. {w}А у меня своя."
    "Но всё же, в такие моменты кажется, что ты делаешь всё не так."
    "А как тогда? Так как раньше - ни в коем случае. {w}Женского коварства я больше не потерплю."
    "Наладить общение с кем-нибудь из реального мира?"
    "Что ж, можно попробовать найти себе друга. {w}Возможно даже больше, чем просто друга."
    hide bg bus_stop
    with dissolve
    scene bg bus_stop
    with dissolve
    "Размышлял, и не заметил, как ушёл очень далеко. {w}Город у нас не очень большой, но я успел дойти от одного конца до другого."
    "Придётся ехать на автобусе, должны уже ходить." 
    "Я дошёл до остановки и снова закурил."
    "Какое-то странное чувство начало отдаваться внутри меня тупой болью."
    "Не понимая, что происходит, я достал еще одну сигарету."
    "Как будто осколок чего-то очень важного откололся от меня, и теперь всё моё существо скорбит об этой потере."
    "Вдруг я осознал причину своего необычного состояния."
    me "Я не хочу домой."
    "Сказал в пустоту и тут же упал в сугроб."
    "Как это могло произойти? {w}Я не хочу ехать в свою квартиру, в единственное место, где я могу чувствовать себя спокойно."
    "Следующий поток мыслей окончательно сбил меня с толку:"
    th "А куда мне еще идти, кроме своего дома?!"
    hide bg bus_stop
    with dissolve
    scene bg bus_stop
    with dissolve
    play ambience sfx_bus_stop
    "Хотелось лежать в холодном снегу до оцепенения, но тут послышались звуки приближающегося автобуса."
    show bg int_liaz with dissolve
    "На автомате я зашёл в него и сел на место в конце салона, уверяя себя, что к концу поездки тревожные мысли просто покинут меня сами."
    "Так как я не спал уже почти сутки, вздремнуть в автобусе показалось мне прекрасной идеей.{w} Быть может, отдохну немного, и голова встанет на место."
    stop ambience 
    "Тем более, мне до конечной..."
    hide bg int_liaz
    with dissolve2
    show un angry2 dress at right
    with dissolve2
    un "Здесь должно быть интро.{w} Нам нужно его сделать."
    hide un with dissolve
    jump day1_begin
    return