init:
    $ mods["iailil"]=u"Everlasting Gay Porn"
    $ dnl= Character(u'Даня', color="66FF33", what_color="E2C778",)
    
label iailil:
    scene anim prolog_1 
    with dissolve2
    $ set_mode_adv()
    play music music_list["a_promise_from_distant_days"] fadein 5
    th "Мне снова снился странный сон."
    th "Вокруг какие-то девушки, но мне нет до них дела.{w} Почему они являются мне?"
    th "Лишь иногда в этих снах я могу уловить силуэты нормальных пацанов, с которыми можно побазарить по душам бля буду."
    th "Что-то случилось, и я заснул короче" 
    scene bg semen_room
    with dissolve2
    th "Моя квартира - это только моя квартира.{w} Моё личное пространство."
    th "Только здесь я себя чувствую себя спокойно. {w}Только тут живы мое сознание,воображение и чувства."
    th "Трудно найти более защищенное для меня и моих мыслей место, чем эта маленькая квартирка в спальном районе города."
    th "Здесь я защищен от всех внешних факторов большого города: суета, плохая погода, а самое важное - социум. "
    stop music fadeout 2
    with dissolve2
    $ set_mode_nvl() 
    play music music_list["farewell_to_the_past_full"] fadein 1
    "Когда-то это место было не только для меня, но эти времена давно в прошлом."
    "Да что уж там, раньше я даже мог проводить свой досуг вне дома больше, чем пару часов в неделю."
    "Общение с людьми, долгие прогулки по паркам, бесчисленное количество вечеринок и праздников. Все это было, сейчас - нет."
    "Теперь я твёрдо уверен, что всё, что мне нужно - это лишь я сам.{w} Ещё системный блок с монитором."
    "Всё из-за цепочки событий, в ходе которой я убедился, что крепко связывать себя с кем-либо чревато последующими болью и страданием."
    "Это неизбежно.{w} Никто не сможет понять тебя, как ты сам.{w} А те, кто считают иначе - тешатся одной лишь мыслью об этом." 
    $ set_mode_nvl()
    "Так, понемногу, я начал отдаляться от остального мира."
    "И совсем не важно, по какой причине это произошло. {w}Рано или поздно осознание должно было прийти, сейчас я это прекрасно понимаю."
    "Я бы не сказал, что мой метод познания истины был действительно мучительным."
    "Через это прошли множество таких же парней, как и я.{w} Разочарование в верности, в любви, в ...{w} Затем суды, выяснение правоты и просто желание отомстить."
    $ set_mode_nvl() 
    "Чем же я занимаюсь у себя дома?{w} Можно сказать ничем. {w} Работа в офисе плавно сменилась фрилансом, на это занятие у меня уходит только пару часов в день."
    "Остальное время я полностью предаюсь гедонизму. {w}Сериалы, игры, аниме."
    "Когда особенно скучно, вступаю в дискуссии с такими же отшельниками, как и я, на различные темы."
    "С некоторыми из них даже получается поддерживать общение весьма долгое время, но никаких попыток встретиться в ИРЛ я не принимаю."
    "Ну вот мы сядем в кафе, и  будем молчать. {w}Зачем?"
    "Гораздо легче иметь дело с людьми в интернете,{w} Легче скрывать то, что не хотел бы показывать."
    $ set_mode_adv()
    "Наверняка многие не поймут меня. {w}С их точки зрения в жизни нужно чего-то добиться."
    "Оставить после себя след, записать своё имя в учебник истории, засесть в памяти людей. {w}Или хотя бы построить дом, посадить дерево, вырастить сына."
    "Но какой в этом всём смысл?"
    "Во-первых, когда я умру, мне будет абсолютно наплевать на то, что произойдёт после моей смерти."
    "А во-вторых, тенденция во вселенной такова, что всё когда-либо разрушается.{w} Все отлично знают, что вселенная возникла в результате Большого Взрыва, при котором было высвобождено огромное количество энергии."
    "Которая с каждой секундой рассеивается всё больше. {w}Звёзды погибают, планеты просто превращаются в огромные глыбы, распадающиеся с течением времени."
    "Нет ничего вечного. {w}Так зачем же лезть из кожи вон ради сомнительных достижений? {w}Я предпочитаю жить просто, в удовольствие." 
    hide bg semen_room
    with dissolve2
    scene bg semen_room_window
    with dissolve2
    stop music fadeout 2
    with dissolve2
    "Я стою, курю в окно и наблюдаю за человечками-муравьями, бродившими по белому полотну на несколько этажей ниже меня."
    th "Интересно, как они размышляют? {w}Приходят ли им в голову те же мысли, что и мне?"
    th "Вряд ли.{w} Если бы так и было, я не наблюдал бы сейчас за ними."
    "Впрочем, мне и самому в скором времени нужно оказаться на улице.{w} Каждое утро первого января я имею обычай гулять по пустынному городу."
    "..."   
    scene bg bus_stop
    with dissolve2
    play ambience ambience_cold_wind_loop
    show snow
    show el serios pioneer 
    el "You are gay"
    show sh laugh far
    with dissolve2
    sh "Мы тоже"
    return