init:
    $ mods["iailil"]=u"Everlasting Gay Porn"
    $ dnl= Character(u'Даня', color="66FF33", what_color="E2C778",)
    
label iailil:
    scene anim prolog_1 
    with dissolve2
    $ set_mode_adv()
    play music music_list["a_promise_from_distant_days"] fadein 5
    th "Мне снова снился странный сон."
    th "Вокруг какие-то девушки, но мне нет до них дела.{w}Почему они являются мне?"
    th "Лишь иногда в этих снах я могу уловить силуэты нормальных пацанов, с которыми можно побазарить по душам бля буду."
    th "Что-то случилось, и я заснул короче" 
    scene bg semen_room
    with dissolve2
    th "Моя квартира - это только моя квартира.{w}Моё личное пространство."
    th "Только здесь я себя чувствую себя спокойно. {w}Только тут живы мое сознание,воображение и чувства.{w}Ну покрайней мере все что от них осталось"
    th "Трудно найти более защищенное для меня и моих мыслей место, чем эта маленькая квартирка в спальном районе города.{w}Ну, мне так кажется."
    th "Здесь я защищен от всех внешних факторов большого города: суета, плохая погода,а самое важное - социум "
    th "Когда-то это место было не только для меня, но эти времена давно в прошлом."
    stop music fadeout 2
    $ set_mode_nvl() 
    play music music_list["farewell_to_the_past_full"] fadein 1
    "Да что уж там, раньше я даже мог проводить свой досуг вне дома больше, чем пару часов в неделю"
    "Общение с людьми, долгие прогули по паркам,бесчисленное количесво вечеринок и праздников. Все это было, сейчас - нет "
    "Теперь я твёрдо уверен, что всё, что мне нужно - это лишь я сам.{w}Ну ещё системный блок с монитором"
    "Всё из-за цепочки событий, в ходе которой я убедился, что крепко связывать себя с кем-либо чревато последующими болью и страданием."
    "Это неизбежно.{w} Никто не сможет понять тебя, как ты сам.{w} А те, кто считают иначе - тешатся одной лишь мыслью об этом" 
    stop music fadeout 2
    $ set_mode_adv()
    scene bg int_bus
    with dissolve2
    show snow
    show dv angry pioneer
    show un cry pioneer at right
    dv "I love my dick is sucked"
    me "Чё бля происходит"
    show un smile pioneer at right
    un "Оооооооооо либераху прорвало"
    show dv evil pioneer
    dv "сука ты пидорас ка"
    show mt rage panama pioneer at center
    mt "вы позорите совёнок"
    scene bg ext_bus_night
    show sl serios pioner 
    with dissolve2
    return