label day1_begin:
    play music music_list["orchid"] fadein 5
    show unblink
    show bg int_bus with dissolve
    "Я проснулся от яркого солнечного света и невыносимой жары."
    "Ещё бы, в разгар лета носить зимнее пальто!"
    "Так, стоп... {w}ЛЕТО?!"
    "Глазные яблоки тут же начали усиленно метаться из стороны в сторону для составления отчёта о визуальной составляющей обстановки."
    "Автобус, шоссе, и ни души рядом. {w}Здорово."
    "Нужно воспроизвести последнее воспоминание."
    "Тааак.{w} Значит сел в автобус и уснул."
    "Постараемся перебрать все возможные варианты моего попадания сюда."
    "Может быть, я проспал полгода, и никто меня не разбудил, поэтому я до сих пор сижу в этом грёбаном автобусе. {w}И, наверняка, где-нибудь здесь есть депо."
    "На лице сама собой возникла нервная улыбка, когда я представил, как стал живой достопримечательностью города.{w} Мужик спит в автобусе полгода и никуда не выходит! {w}И каждый взглянуть на меня может, удостовериться."
    "К сожалению, такое возможно вряд ли, и не только потому, что проснулся я в абсолютно другом автобусе."
    th "Чёрт, о чём я вообще думаю?"
    "А о чём, собственно, нужно?"
    "Духота давила всем весом. Голова трещала, готовая взорваться с минуты на минуту."
    th "Нельзя просто сидеть, надо что-то сделать!"
    stop music fadeout 2
    "Недавно я наткнулся на любопытную статью в интернете. {w}Она гласила о том, что высокоразвитых в интеллектуальном плане людей сложно чем-то удивить."
    "Якобы, они невозмутимо реагируют на все превратности жизни."
    "Поэтому, я постарался максимально успокоиться, и с такими мыслями направился к выходу из автобуса."
    th "Интересно, становлюсь ли я умнее от того, что действую по примеру этой статьи?"
    show bg ext_bus with dissolve2
    "Снаружи стояла невыносимая жара, и солнце пекло настолько, что я уже пожалел о своём решении."
    "Пальто с шарфом пришлось оставить в автобусе, чтобы не получить тепловой удар.{w} Но шерстяного свитера, облегающего моё туловище, было достаточно, чтобы пот струями лился по телу."
    th "Снять что ли его?"
    "Между смертью и возможностью быть увиденным я выбрал второе."
    "Да здесь никого и нет."
    "Облегчённо вздохнув, я принялся изучать окрестности."
    show bg ext_camp_entrance_day with dissolve
    play music music_list["that_s_our_madhouse"]
    "И заметил девушку, наблюдающую на меня из-за ворот!"
    "Быстрее одеваться!"
    "Девушка, похоже, поняла, что её раскрыли и, улыбаюсь во все 32 зуба, начала двигаться в мою сторону."
    stop music fadeout 2
    show sl smile2 pioneer far with dissolve
    sl "Здравствуй! Я смотрю, ты... новенький..."
    "Мне очень не понравилась интонация, с которой было произнесено последнее слово."
    show cg d6_un_punch
    un "Бум!"
    show un laugh pioneer at right with dissolve
    return